АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/алк_ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыКПоступлениюНаСкладыСерии/алк_ЗапасыКПоступлениюНаСкладыСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыКПоступлениюНаСкладыСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыНаСкладахСерии/алк_ЗапасыНаСкладахСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыНаСкладахСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		
	КонецПроцедуры
	
	// Процедура заполняет табличную часть Запасы по остаткам на складе.
	//
	Процедура ЗаполнитьЗапасыПоОстаткамНаСкладе(СписокКатегорий) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.СерийныйНомер КАК СерийныйНомер,
		|	СУММА(ВложенныйЗапрос.КоличествоПакетовОстаток) КАК КоличествоПакетов,
		|	ВложенныйЗапрос.СерийныйНомер.Владелец КАК Номенклатура
		|ИЗ
		|	(ВЫБРАТЬ
		|		алк_ЗапасыКПоступлениюНаСкладыСерии.Организация КАК Организация,
		|		алк_ЗапасыКПоступлениюНаСкладыСерии.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		алк_ЗапасыКПоступлениюНаСкладыСерии.Ячейка КАК Ячейка,
		|		алк_ЗапасыКПоступлениюНаСкладыСерии.СерийныйНомер КАК СерийныйНомер,
		|		алк_ЗапасыКПоступлениюНаСкладыСерии.КоличествоПакетовОстаток КАК КоличествоПакетовОстаток
		|	ИЗ
		|		РегистрНакопления.алк_ЗапасыКПоступлениюНаСкладыСерии.Остатки(
		|				,
		|				Организация = &Организация
		|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|					И Ячейка = &Ячейка) КАК алк_ЗапасыКПоступлениюНаСкладыСерии
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.Организация,
		|		ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.СтруктурнаяЕдиница,
		|		ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.Ячейка,
		|		ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.СерийныйНомер,
		|		ВЫБОР
		|			КОГДА ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.КоличествоПакетов, 0)
		|			ИНАЧЕ -ЕСТЬNULL(ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.КоличествоПакетов, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.алк_ЗапасыКПоступлениюНаСкладыСерии КАК ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии
		|	ГДЕ
		|		ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.Регистратор = &Ссылка
		|		И ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДвижениеДокумента_алк_ЗапасыКПоступлениюНаСкладыСерии.Период <= &Период) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.КоличествоПакетовОстаток > 0
		|	И ВложенныйЗапрос.СерийныйНомер.Владелец В (&Владелец)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СерийныйНомер,
		|	ВложенныйЗапрос.СерийныйНомер.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерийныйНомер
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Ячейка", Ячейка);
		
		СпВладельцы = Новый СписокЗначений;
		Для Каждого СтрКатегория из СписокКатегорий Цикл
			
			СпВладельцы.Добавить(РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(СтрКатегория.Значение));
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Владелец", СпВладельцы);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецПроцедуры //ЗаполнитьЗапасыПоОстаткамНаСкладе
	
	#КонецОбласти
	
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаПроведения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
		
		//++мод [Пакушев И.С.] [05.10.2023]   	
		
		Если (ЭтотОбъект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку Или
			ЭтотОбъект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки) 
			И ЭтотОбъект.Дата >= Дата('20231002') Тогда 
			
			Сообщить("Данная операция не будет проведена! Документ возможно сохранить.");
			
			Отказ = Истина;
			
		КонецЕсли;
		
		//++


		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_ПеремещениеЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		Если ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства 
			Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УПП Тогда
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
			
			Если Направление = Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда
				
				РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
				
			КонецЕсли; 
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда    //раньше было переупаковкой, зачем-то,  перенес на "ПередачаНаПереупаковку"
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПереупаковку Тогда
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьЗапасыОрганизацииСерии(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки Тогда 
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку
			или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство Тогда 
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);  
			
			Если Направление = Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда
				
				РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
				
			КонецЕсли; 
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки
			или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства Тогда 
			
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			//РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);   // пакеты списываются
			
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение
			ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда
						
			РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли; 
		РФПСервер.ОтразитьОстаткиНезавершенногоПроизводства(ДополнительныеСвойства, Движения, Отказ);
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ);
		
		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
			РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

		
		//Здесь нужно получить и положить в ДополнительныеСвойства данные из регистра которые были еще до изменения в документе 
		//для того чтобы в контроль попали еще и удаленные строки
		ДополнитьТаблицуДопСвойств(ДополнительныеСвойства, "ТаблицаЗапасыНаСкладахСерии");
		ДополнитьТаблицуДопСвойств(ДополнительныеСвойства, "ТаблицаЗапасыКПоступлениюНаСкладыСерии");	
		//\\
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		//КонтрольОстатков
		//Если (Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы 
		//	И ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение)
		//	Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство 
		//	Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки
		//	Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства Тогда
		//	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии", Отказ,, Истина);
		//ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства 
		//	Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки
		//	Или ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство
		//	//Добавлено по заявке 0000168716 Дубоделов Э.А 14.04.2023
		//	ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку Тогда
		//	//Дубоделов Э.А 14.04.2023 
		//	
		//	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыКПоступлениюНаСкладыСерии", Отказ,, Истина);
		//КонецЕсли;		
		////\\  
		//
		////Пакушев И.С. 2023.11.15
		//Если ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства  
		//	ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда 
		//	
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);
		
		//КонецЕсли;
		//Пакушев И.С. 2023.11.15 
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	Процедура ОбработкаУдаленияПроведения(Отказ)
		// Инициализация данных документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		//Документы.алк_ПеремещениеЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		//КонтрольОстатков
		Если (Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы 
			И ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение)
			ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство 
			ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки Тогда
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства 
			ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки Тогда
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыКПоступлениюНаСкладыСерии", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;		
		//\\  
		
		//Пакушев И.С. 2023.11.15
		Если ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства  
			ИЛИ ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда 
			
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		
		КонецЕсли;
		//Пакушев И.С. 2023.11.15 

		
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		
		//Если ЭтотОбъект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства Тогда
		//	
		//	Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя, Новый Структура("Дельта", 0)); 
		//	
		//ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда
		//	
		//	//ко времени передачи на СГП добавляем +5 секунд
		//	Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя, Новый Структура("Дельта", 5)); 
		//				
		//КонецЕсли; 
		
		//МаксимальныйПериодПакета = ДАТА(1,1,1);
		//Для Каждого стр ИЗ Запасы Цикл
		//	ПоследнийПериодПакета = РфпСервер.ПолучитьПоследнийПериодПакета(Ссылка,Дата,ДатаСмены
		//	,Смена,СтруктурнаяЕдиница,Штабель,стр.СерийныйНомер,Участок);
		//	Если МаксимальныйПериодПакета < ПоследнийПериодПакета Тогда 
		//		МаксимальныйПериодПакета = ПоследнийПериодПакета;
		//	КонецЕсли;	
		//КонецЦикла;  
		//
		//Дата = МаксимальныйПериодПакета; 
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда 
			Дата = ТекущаяДата();
		КонецЕсли;
			
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			//Соберем массив для контроля остатков  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|  алк_ОстаткиЗапасов.СерийныйНомер
			|ИЗ
			|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);  
			РезультатЗапроса = Запрос.Выполнить();  
			Выборка = РезультатЗапроса.Выгрузить();
			
			МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
			
			ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
			
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти
	
	//ДОЛЖНА ВЫЗЫВАТЬСЯ ТОЛЬКО ДО ЗАПИСИ НОВЫХ ДВИЖЕНИЙ
	//Дополняет таблицу из доп свойств данными которые были удалены
	Процедура ДополнитьТаблицуДопСвойств(ДополнительныеСвойства, НаименованиеТаблицы)
		
		Если НаименованиеТаблицы = "ТаблицаЗапасыНаСкладахСерии" Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	алк_ЗапасыНаСкладахСерии.Организация,
			|	алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница,
			|	алк_ЗапасыНаСкладахСерии.Ячейка,
			|	алк_ЗапасыНаСкладахСерии.СерийныйНомер,
			|	алк_ЗапасыНаСкладахСерии.ВидДвижения,
			|	алк_ЗапасыНаСкладахСерии.Период,
			|	алк_ЗапасыНаСкладахСерии.КоличествоПакетов,
			|	алк_ЗапасыНаСкладахСерии.Номенклатура,
			|	алк_ЗапасыНаСкладахСерии.ДатаСмены,
			|	алк_ЗапасыНаСкладахСерии.Смена,
			|	алк_ЗапасыНаСкладахСерии.Операция,
			|	алк_ЗапасыНаСкладахСерии.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ЗапасыНаСкладахСерии КАК алк_ЗапасыНаСкладахСерии
			|ГДЕ
			|	алк_ЗапасыНаСкладахСерии.Регистратор = &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", ДополнительныеСвойства.ДляПроведения.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("СерийныйНомер", ВыборкаДетальныеЗаписи.СерийныйНомер);
				Отбор.Вставить("ВидДвижения", ВыборкаДетальныеЗаписи.ВидДвижения);
				Если ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.НайтиСтроки(Отбор).Количество() = 0 Тогда 
					ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.Добавить(), ВыборкаДетальныеЗаписи);
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли  НаименованиеТаблицы = "ТаблицаЗапасыКПоступлениюНаСкладыСерии" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.Организация,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.СтруктурнаяЕдиница,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.Ячейка,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.СерийныйНомер,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.ВидДвижения,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.Период,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.КоличествоПакетов,
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.Номенклатура
			|ИЗ
			|	РегистрНакопления.алк_ЗапасыКПоступлениюНаСкладыСерии КАК алк_ЗапасыКПоступлениюНаСкладыСерии
			|ГДЕ
			|	алк_ЗапасыКПоступлениюНаСкладыСерии.Регистратор = &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", ДополнительныеСвойства.ДляПроведения.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("СерийныйНомер", ВыборкаДетальныеЗаписи.СерийныйНомер);
				Отбор.Вставить("ВидДвижения", ВыборкаДетальныеЗаписи.ВидДвижения);
				Если ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.НайтиСтроки(Отбор).Количество() = 0 Тогда 
					ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.Добавить(), ВыборкаДетальныеЗаписи);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПроцедуры	

#КонецЕсли
